ednieuw/ESP32Communications/ESP32Arduino_CommV014/ESP32Arduino_CommV014.ino
class MyCallbacks: public NimBLECharacteristicCallbacks 
{
 void onWrite(NimBLECharacteristic *pCharacteristic, NimBLEConnInfo& connInfo) override  
  {
   std::string rxValue = pCharacteristic->getValue();
   ReceivedMessageBLE = rxValue + "\n";
  //  if (rxValue.length() > 0) {for (int i = 0; i < rxValue.length(); i++) printf("%c",rxValue[i]); }  printf("\n");
  }  
};

//--------------------------------------------                                                //
// BLE Start BLE Service
//--------------------------------------------
void StartBLEService(void)
{
 NimBLEDevice::init(Mem.BLEbroadcastName);                                                    // Create the BLE Device
 pServer = NimBLEDevice::createServer();                                                      // Create the BLE Server
 pServer->setCallbacks(new MyServerCallbacks());
 BLEService *pService = pServer->createService(SERVICE_UUID);                                 // Create the BLE Service
 pTxCharacteristic                     =                                                      // Create a BLE Characteristic 
     pService->createCharacteristic(CHARACTERISTIC_UUID_TX, NIMBLE_PROPERTY::NOTIFY);                 
 BLECharacteristic * pRxCharacteristic = 
     pService->createCharacteristic(CHARACTERISTIC_UUID_RX, NIMBLE_PROPERTY::WRITE);
 pRxCharacteristic->setCallbacks(new MyCallbacks());
 pService->start(); 
 BLEAdvertising *pAdvertising = NimBLEDevice::getAdvertising();
 pAdvertising->addServiceUUID(SERVICE_UUID); 
 pAdvertising->setName(Mem.BLEbroadcastName);
 pServer->start();                                                                            // Start the server  Nodig??
 pServer->getAdvertising()->start();    
    // Add this to keep advertising running
 //   pAdvertising->setConnectable(true);                                                     // Start advertising
 TekstSprint("BLE Waiting a client connection to notify ...\n"); 
}

//--------------------------------------------                                                //
// BLE CheckBLE input and rework string
// After 1/4 hour the BLE connection is disconnected
//--------------------------------------------
void CheckBLE(void)
{
if (BLEConnected && !oldBLEConnected) 
  {
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = millis();                                                              // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
  }
if (!BLEConnected && oldBLEConnected)                                                        // If device is disconnected start advertising
  {
   delay(300);
   pServer->startAdvertising();
   TekstSprint("Start advertising\n");
   oldBLEConnected = BLEConnected;
   BLEConnectedSince = 0;                                                                     // Reset BLE connection timer
  }
if ((BLEConnected && BLEConnectedSince > 0) && (millis() - BLEConnectedSince > 900000))       // Disconnect if connected longer than 15 minutes inactivity 
  {
   auto connHandles = NimBLEDevice::getServer()->getPeerDevices();                            // Vector of uint16_t handles
   if (!connHandles.empty()) 
     {
      uint16_t conn_handle = connHandles[0];
      int rc = ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);                    // Reason = 0x13 = user terminated
      if (rc == 0) { TekstSprint("Disconnected BLE client after 1/4 hour\n"); } 
      else {snprintf(sptext, sizeof(sptext),"BLE disconnect failed, error: %d\n", rc); TekstSprint(sptext);}
       BLEConnectedSince = 0;
      }
  }
 if(ReceivedMessageBLE.length()>0)
   {
    SendMessageBLE(ReceivedMessageBLE);
    String BLEtext = ReceivedMessageBLE.c_str();
    ReceivedMessageBLE = "";
    ReworkInputString(BLEtext); 
    BLEConnectedSince = millis();                                                             // Mark time of last connection 1/4 hour after this time the BLE connection will disconnect
   }
}

// --------- TimeSender
//--------------------------------------------                                                //
// BLE TimeSender client
//--------------------------------------------
void SendMessageTimeSender(const char* msg)
{
 if (!TSConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TSConnected = false; return; }
 size_t len = strlen(msg);
 pRemoteRX->writeValue((uint8_t*)msg, len, false);
}


/*
  static int writeCounter = 0;
  const int MAX_WRITES_BEFORE_RESET = 15;  // Reset before hitting the limit  
//--------------------------------------------                                                //
// BLE TimeSender client
//--------------------------------------------
void SendMessageTimeSender(const char* msg)
{
 if (!TSConnected || !msg || !pRemoteRX || !pClient) return;
 if (!pClient->isConnected()) { TSConnected = false; return; }
 size_t len = strlen(msg);
//  if (writeCounter >= MAX_WRITES_BEFORE_RESET)                                                // Check if we're approaching the limit
//    {
//     if(Serial) Serial.println("Write limit reached - reconnecting...");
//     delay(1000); //ReconnectTimeSender();
//     writeCounter = 0;
//    // vTaskDelay(500 / portTICK_PERIOD_MS);                                                    // Wait for reconnection  
//     if (!pRemoteRX || !pRemoteRX->canWrite()) return;
//    }
 bool success = pRemoteRX->writeValue((uint8_t*)msg, len, false);
 if (!success) { if(Serial) Serial.printf("Write failed at count %d\n", writeCounter);  }
 vTaskDelay(10 / portTICK_PERIOD_MS);
 writeCounter++;
}*/
//--------------------------------------------                                                //
// BLE TimeSender Reconnect time sender
//--------------------------------------------
void ReconnectTimeSender() 
{
 if (pClient && pClient->isConnected()) { pClient->disconnect();  }
 vTaskDelay(200 / portTICK_PERIOD_MS);
 TSConnected        = false;                                                                  // Trigger reconnection
 TSConnecting       = false;
 TShaveFoundAddr    = true;                                                                   // Keep the address
 TSconnectRequested = true;
 Connect_TimeSender();                                                                        // The main loop should call Connect_TimeSender() Or call it directly here:
}
//--------------------------------------------                                                //
// BLE TimeSender RX notify callback
// -------------------------------------------
static void TimeSenderNotifyCB( NimBLERemoteCharacteristic*,  uint8_t* data, size_t len, bool notify)
{
 static char buf[128];
 size_t n = (len < sizeof(buf) - 1) ? len : sizeof(buf) - 1;
 memcpy(buf, data, n);
 buf[n] = 0;
 ReworkInputString(String(buf));
 BLEConnectedSince = millis();
}

//--------------------------------------------                                                //
// BLE TimeSender Scan callbacks
// Client callbacks
// -------------------------------------------
class TimeSenderClientCB : public NimBLEClientCallbacks
{
 void onConnect(NimBLEClient* client) override
   {
    TSConnected = true;
    TSConnecting = false;
    BLEConnectedSince = millis();
    Tekstprintln("TimeSender connected");
   }

 void onDisconnect(NimBLEClient* client, int reason) override
   {
    Tekstprintlnf("TimeSender disconnected (reason: %d)", reason); 
    TSConnected        = false;
    TSConnecting       = false;
    TShaveFoundAddr    = false;
    TSconnectRequested = false;
    TimeSenderRunning  = false;                                                              // Reset flag
    if (pClient)                                                                             // Clean up client
    {
      NimBLEDevice::deleteClient(pClient);
      pClient = nullptr;
    }
    pRemoteTX = nullptr;
    pRemoteRX = nullptr;
    NimBLEScan* scan = NimBLEDevice::getScan();                                               // Stop any existing scan first
    if (scan->isScanning())  {  scan->stop();   delay(100);  }
    delay(200);
    StartTimeSenderScan();                                                                    // Start new scan
   }
};

//--------------------------------------------                                                //
// Scan callbacks
//--------------------------------------------
class TimeSenderScanCB : public NimBLEScanCallbacks
{
 void onResult(const NimBLEAdvertisedDevice* dev) override
   {
    if (TSConnecting) return;
    if (!dev->haveName()) return;
    std::string rawName = dev->getName();
    if (rawName.find(TIMESENDER_DEVICE_NAME) == std::string::npos) return;
    if (dev->getRSSI() <= TIMESENDER_MIN_RSSI) return;
    if (!dev->isConnectable()) return;
    if (!dev->isAdvertisingService(NimBLEUUID(SERVICE_UUID))) return;
    TSfoundAddr        = dev->getAddress();
    TShaveFoundAddr    = true;
    TSconnectRequested = true;
    NimBLEDevice::getScan()->stop();
   }
};

//--------------------------------------------                                                //
// BLE TimeSender Start Time Sender scan
//--------------------------------------------
void StartTimeSenderScan(void)
{
 NimBLEScan* scan = NimBLEDevice::getScan();
 if (TimeSenderRunning && !scan->isScanning())                                                // Reset flag if scan isn't actually running
   {
    TimeSenderRunning = false;
    Tekstprintln("Flag reset - scan not running");
   }
 if (TimeSenderRunning)  { Tekstprintln("Scan already running - skipping");   return;}        // Only start if not already running
 if (scan->isScanning()) { scan->stop();  delay(100);}                                        // Stop any existing scan 
 TimeSenderRunning = true; 
 scan->setActiveScan(true);
 scan->setInterval(160);
 scan->setWindow(30);
 scan->setScanCallbacks(new TimeSenderScanCB(), true);  // true = delete old callback 
 if (!scan->start(0, false, false))
   {
    Tekstprintln("ERROR: Failed to start TimeSender scan");
    TimeSenderRunning = false;
   }
 else
   {
    lastTimeSenderScan = millis();
    Tekstprintln("TimeSender scan started");
   }
}
//--------------------------------------------                                                //
// BLE TimeSender Stop Time Sender
//--------------------------------------------
void StopTimeSender()
{
 NimBLEDevice::getScan()->stop();
 if (TSConnected) pClient->disconnect();
 TSConnected = false;
 TSConnecting          = false;
 pRemoteTX             = nullptr;
 pRemoteRX             = nullptr;
 pClient               = nullptr;
 TShaveFoundAddr       = false;
 TSconnectRequested    = false;
}

//--------------------------------------------                                                //
// BLE TimeSender Connect TimeSender
// -------------------------------------------
static void Connect_TimeSender(void)
{
 if (!TShaveFoundAddr || TSConnected || TSConnecting) return;
 const int MAX_CONNECT_ATTEMPTS = 3;
 const unsigned long POST_DISCONNECT_DELAY_MS = 150;
 
 for (int attempt = 1; attempt <= MAX_CONNECT_ATTEMPTS; ++attempt)
    {
     NimBLEDevice::getScan()->stop();
     delay(100);
     pClient = NimBLEDevice::createClient();
     pClient->setClientCallbacks(new TimeSenderClientCB(), false);
     TSConnecting      = true;
     TSconnectStartms  = millis();
     
     if (!pClient->connect(TSfoundAddr))
        {
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
       
      NimBLERemoteService* svc = pClient->getService(SERVICE_UUID);
      if (!svc)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      pRemoteTX = svc->getCharacteristic(CHARACTERISTIC_UUID_TX);
      pRemoteRX = svc->getCharacteristic(CHARACTERISTIC_UUID_RX);
      if (!pRemoteTX || !pRemoteRX)
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      if (!pRemoteTX->subscribe(true, TimeSenderNotifyCB, true))
        {
         pClient->disconnect();
         NimBLEDevice::deleteClient(pClient);
         pClient = nullptr;
         TSConnecting = false;
         delay(POST_DISCONNECT_DELAY_MS);
         continue;
        }
      
      BLEConnectedSince   = millis();
      TShaveFoundAddr     = false;
      TSconnectRequested  = false;
      TSConnecting        = false;
      Tekstprintln("TimeSender connected");
      return;
    }

 if (pClient)
   {
    NimBLEDevice::deleteClient(pClient);
    pClient = nullptr;
   }
 TShaveFoundAddr    = false;
 TSconnectRequested = false;
 Tekstprintln("TimeSender connection failed - restarting scan");
 NimBLEDevice::getScan()->start(0, false, false);
}


//--------------------------------------------                                                //
// BLE TimeSender Check TimeSender Client
//--------------------------------------------
void CheckTimeSenderClient(void)
{
 unsigned long now = millis();
 NimBLEScan* scan = NimBLEDevice::getScan();
 if (!scan->isScanning() && TimeSenderRunning)                                                // If scanning is not active and flag is still true, reset it to allow rescanning
   {
    TimeSenderRunning = false;                                                                // Allow rescanning
    Tekstprintln("TimeSenderRunning flag reset - ready for rescan");
   }
 if (TSconnectRequested && TShaveFoundAddr && !TSConnected && !TSConnecting)                  // Handle connect request
   {
    TSconnectRequested = false;
    Connect_TimeSender();
   }
 if (TSConnecting && (now - TSconnectStartms > CONNECT_TIMEOUT_MS))                           // Handle connection timeout
   {
    if (pClient)
      {
       if (pClient->isConnected()) pClient->disconnect();
       NimBLEDevice::deleteClient(pClient);
       pClient = nullptr;
      }
    TSConnecting = false;
    TShaveFoundAddr = false;
    TSconnectRequested = false;
    TimeSenderRunning = false;                                                                // Reset flag to allow new scan
    Tekstprintln("Connect timeout - resetting for new scan");
    scan->start(0, false, false);
  }

 if (!TSConnected && !scan->isScanning())
   {
    unsigned long timeSinceLastScan = now - lastTimeSenderScan;
    if (timeSinceLastScan > 3000)                                                             // Reset the flag if it's been long enough (allows rescanning)
      {
       TimeSenderRunning = false;  // Reset flag for new attempt
       StartTimeSenderScan();       // This will restart the scan
       Tekstprintlnf("Periodic rescan initiated (%.1f seconds since last scan)",timeSinceLastScan / 1000.0);
      }
    }
}
// End Time Sender

//--------------------------------------------                                                //
// WIFI WIFIEvents
// Yes — using WiFi.onEvent() is definitely the better and more reliable way to handle Wi-Fi connection state on the ESP32.
// Why WiFi.onEvent() is better
// 1. It’s fully asynchronous
//--------------------------------------------
void WiFiEvent(WiFiEvent_t event)
{
 // snprintf(sptext, sizeof(sptext),"[WiFi-event] event: %d  : ", event);  Tekstprint(sptext);
 WiFiEventInfo_t info;
 static bool LostPrinted = false;
 switch (event) 
     {
 /*
 ARDUINO_EVENT_WIFI_STA_CONNECTED → Connected to AP (no IP yet)
ARDUINO_EVENT_WIFI_STA_GOT_IP → DHCP success (ready for servers, OTA)
ARDUINO_EVENT_WIFI_STA_DISCONNECTED → Lost connection
ARDUINO_EVENT_WIFI_STA_STOP → WiFi off
 */     
        case ARDUINO_EVENT_WIFI_READY: 
            Tekstprintln("WiFi interface ready");
            break;
        case ARDUINO_EVENT_WIFI_SCAN_DONE:
            Tekstprintln("Completed scan for access points");
            break;
        case ARDUINO_EVENT_WIFI_STA_START:
            Tekstprintln("WiFi client started");
            break;
        case ARDUINO_EVENT_WIFI_STA_STOP:
            Tekstprintln("WiFi clients stopped");
            break;
        case ARDUINO_EVENT_WIFI_STA_CONNECTED:
            Tekstprintln("Connected to access point");
            LostPrinted = false;
            break;
       case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
            if(!LostPrinted)
             {
              snprintf(sptext, sizeof(sptext),"WiFi lost connection.");                                          // Reason: %d",info.wifi_sta_disconnected.reason); 
              Tekstprintln(sptext);
              LostPrinted = true;
             }
            //WiFi.reconnect(); //is checked in EveryMinuteUpdate()
            break;
        case ARDUINO_EVENT_WIFI_STA_AUTHMODE_CHANGE:
            Tekstprintln("Authentication mode of access point has changed");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP:
        /*
✔ Wi-Fi connected
✔ IP address assigned
✔ Network parameters available (IP, subnet, gateway, DNS)
✔ Triggered exactly when it happens
        */
            snprintf(sptext, sizeof(sptext),"Connected to : %s",WiFi.SSID().c_str());
            Tekstprintln(sptext);
            snprintf(sptext, sizeof(sptext), "Obtained IP address: %d.%d.%d.%d", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3] );
            Tekstprintln(sptext);         
            strcpy(Mem.SSID,      WiFi.SSID().c_str());
            strcpy(Mem.Password , WiFi.psk().c_str());                                         // Store SSID and password
            Mem.NTPOn        = 1;                                                              // NTP On
            Mem.WIFIOn       = 1;                                                              // WIFI On  
            delay(100);
            WIFIwasConnected = true;                                                            // Now we know the SSID ans password are correct and we can reconnect
            Mem.WIFIcredentials = SET_AND_OK;
            StoreStructInFlashMemory(); 
            break;
        case ARDUINO_EVENT_WIFI_STA_LOST_IP:
            Tekstprintln("Lost IP address and IP address is reset to 0");
            break;
        case ARDUINO_EVENT_WPS_ER_SUCCESS:
            wpsStop();
            delay(100);
            WiFi.begin();
            delay(200);
            snprintf(sptext, sizeof(sptext), "WPS Successfull, stopping WPS and connecting to: %s: ", WiFi.SSID().c_str());
            Tekstprintln(sptext);       
            break;
        case ARDUINO_EVENT_WPS_ER_FAILED:
            Tekstprintln("WPS Failed, retrying");
            wpsStop();
            wpsStart();
            break;
        case ARDUINO_EVENT_WPS_ER_TIMEOUT:
            Tekstprintln("WPS Timedout, Start WPS again");
            wpsStop();
            // wpsStart();
            break;
        case ARDUINO_EVENT_WPS_ER_PIN:
            snprintf(sptext, sizeof(sptext),"WPS_PIN = %s",wpspin2string(info.wps_er_pin.pin_code).c_str());
            Tekstprintln(sptext);
            break;
        case ARDUINO_EVENT_WIFI_AP_START:
            Tekstprintln("WiFi access point started");
            break;
        case ARDUINO_EVENT_WIFI_AP_STOP:
            Tekstprintln("WiFi access point  stopped");
            break;
        case ARDUINO_EVENT_WIFI_AP_STACONNECTED:
            Tekstprintln("Client connected");
            break;
        case ARDUINO_EVENT_WIFI_AP_STADISCONNECTED:
            snprintf(sptext, sizeof(sptext),"Client disconnected.");                                            // Reason: %d",info.wifi_ap_stadisconnected.reason); 
            Tekstprintln(sptext);
            break;
        case ARDUINO_EVENT_WIFI_AP_STAIPASSIGNED:
            Tekstprintln("Assigned IP address to client");
            break;
        case ARDUINO_EVENT_WIFI_AP_PROBEREQRECVED:
            Tekstprintln("Received probe request");
            break;
        case ARDUINO_EVENT_WIFI_AP_GOT_IP6:
            Tekstprintln("AP IPv6 is preferred");
            break;
        case ARDUINO_EVENT_WIFI_STA_GOT_IP6:
            Tekstprintln("STA IPv6 is preferred");
            break;
        case ARDUINO_EVENT_ETH_GOT_IP6:
            Tekstprintln("Ethernet IPv6 is preferred");
            break;
        case ARDUINO_EVENT_ETH_START:
            Tekstprintln("Ethernet started");
            break;
        case ARDUINO_EVENT_ETH_STOP:
            Tekstprintln("Ethernet stopped");
            break;
        case ARDUINO_EVENT_ETH_CONNECTED:
            Tekstprintln("Ethernet connected");
            break;
        case ARDUINO_EVENT_ETH_DISCONNECTED:
            // WiFi.scanNetworks will return the number of networks found("Ethernet disconnected");
            break;
        case ARDUINO_EVENT_ETH_GOT_IP:
            Tekstprintln("Obtained IP address");
            break;
        default: break;
    }
    sptext[0] = 0;                                                                            // Clear sptext buffer
}
//--------------------------------------------                                                //
// WIFI Check for WIFI Network 
// Check if WIFI network to connect to is available
// Return true if available
//--------------------------------------------
 bool CheckforWIFINetwork(void)         { return CheckforWIFINetwork(true);}
 bool CheckforWIFINetwork(bool PrintIt)
 {
  if(PrintIt)  Tekstprintln("Scanning for networks");
  int n = WiFi.scanNetworks();                                                                // WiFi.scanNetworks will return the number of networks found
  if (n == 0)                { if(PrintIt) Tekstprintln("No networks found"); return false;} 
  if (n == WIFI_SCAN_FAILED) { if(PrintIt) Tekstprintln("All scan attempts failed - No WIFI connection");  return false;   }
  else 
    { 
     snprintf(sptext, sizeof(sptext),"%d: networks found",n); 
     if(PrintIt) Tekstprintln(sptext);
     for (int i = 0; i < n; ++i)                                                              // Print SSID and RSSI for each network found
      {
        snprintf(sptext, sizeof(sptext),"%2d: %25s %3d %1s",i+1,WiFi.SSID(i).c_str(),(int)WiFi.RSSI(i),(WiFi.encryptionType(i) == WIFI_AUTH_OPEN)?" ":"*");
        if (strcmp(WiFi.SSID(i).c_str(), Mem.SSID)==0) { strcat(sptext, " -- Will connect to");  }
        if(PrintIt) Tekstprintln(sptext);
      }
    }
 return true;                                                                                 // If no SSID and web page at 192.168.4.1 will be started to enter the credentials
 }

