ednieuw/ESP32Communications/ESP32Arduino_CommV014/ESP32Arduino_CommV014.ino
//--------------------------------------------                                                //
// IR-RECEIVER Turn On or off Remote control
// Turns off after 60 seconds
//--------------------------------------------
void ToggleIRpower(void)
{
 static bool powerState = false;                                                              //
 powerState = !powerState;
 if (powerState)
  {
   IR_PowerOnstate = true;                                                                    // React on IR-remote input
   Tekstprintln("IR-remote is ON");
   IR_StartTime = millis();
  }
 else
  {
    Tekstprintln("IR-remote is OFF");
    IR_PowerOnstate = false;                                                                  // Do not react on IR-remote input
  } 
}
//   Ringbuffer

//--------------------------------------------                                                //
// LOGBUFFER Initialize circular logging buffer      
//--------------------------------------------
void InitLogBuffer()
{
 size_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
 size_t reserve = 80000; 
 StoredStartHeaps(true);                                                                      // Store the values before allocation                                                                               //                                     // Keep a safety margin tune this based on your system
 if (largest > reserve)        LogBufferSize = largest - reserve;
 else        LogBufferSize = largest / 2;
 LogBuffer = (char*)heap_caps_malloc(LogBufferSize, MALLOC_CAP_8BIT);
 if (!LogBuffer) { Tekstprintln("ERROR: Could not allocate log buffer"); return; }
 memset(LogBuffer, 0, LogBufferSize);
 LogWritePos = 0;
 LogWrapped  = false;
 Tekstprintlnf(" Log buffer allocated: %u bytes (largest block was %u)",(unsigned)LogBufferSize, (unsigned)largest);
}

//--------------------------------------------                                                //
// LOGBUFFER Add a log line (raw C-string). Always ends with '\n'.
//--------------------------------------------
void AddLog(const char* msg)
{
 if (DoNotLog)   return; 
 if (!LogBuffer) return;
 static size_t Logbufferlength = 0; 
 size_t len = strlen(msg);
 if (len >= LogBufferSize)
    {
     msg += (len - LogBufferSize);                                                             // keep only last part
     len = strlen(msg);
    }
  size_t startPos = LogWritePos;                                                               // Capture starting position for this write
  for (size_t i = 0; i < len; i++)
    {
     LogBuffer[LogWritePos++] = msg[i];
     if (LogWritePos >= LogBufferSize)                                                        // if we are at the end then wrap
        {
         LogWritePos = 0;
         LogWrapped  = true;                                                                  // Essential to find the last 500 lines
        }
    }

//  // Debugging
//  Logbufferlength = min(Logbufferlength + len, LogBufferSize);
//  size_t logicalStart = LogWrapped ? LogWritePos : 0;                                       // Calculate logical start position (oldest data in buffer)
//  Serial.printf("  Write[%u->%u] len:%u | Filled:%u/%u (%u%%) | Start@%u %s\n",
//     (unsigned)startPos,(unsigned)LogWritePos, (unsigned)len, (unsigned)Logbufferlength,
//     (unsigned)LogBufferSize,(unsigned)((Logbufferlength * 100) / LogBufferSize),
//     (unsigned)logicalStart, LogWrapped ? "[WRAPPED]" : ""); 

}

//--------------------------------------------                                                //
// LOGBUFFER Printlast 500 lines      
//--------------------------------------------
void HandleTekstPrint(AsyncWebServerRequest *request)
{
 if (!LogBuffer){ request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 ssize_t lastNewline = -1;                                                                     // Find the actual end of the last complete line (last \n before LogWritePos)
 ssize_t searchPos = (LogWritePos == 0) ? LogBufferSize - 1 : LogWritePos - 1;
  for (size_t i = 0; i < LogBufferSize; i++)
    {
     if (LogBuffer[searchPos] == '\n') 
        {
         lastNewline = searchPos;
         break;
        }
     if (!LogWrapped && searchPos == 0) break;
     searchPos = (searchPos == 0) ? LogBufferSize - 1 : searchPos - 1;
    }
 
 if (lastNewline == -1)                                                                        // No complete lines yet
    {
     request->send(200, "text/plain", "No complete lines in buffer\n");
     return;
    }
 

 size_t lineCount = 0;                                                                        // Now count back 100 for testing) (500) lines from lastNewline
 ssize_t pos = lastNewline;
 
 for (size_t scanned = 0; scanned < LogBufferSize && lineCount < 499; scanned++)               //  499 because we already found one \n
    {
     pos = (pos == 0) ? LogBufferSize - 1 : pos - 1;
     if (LogBuffer[pos] == '\n') lineCount++;
     if (!LogWrapped && pos == 0) break;
    }
 
 // Start is the position right after the newline we stopped at
 size_t start = (pos + 1) % LogBufferSize;
 size_t end = (lastNewline + 1) % LogBufferSize;  // Include the last newline
 
 if (!LogWrapped || start <= end)
   {
    response->write(LogBuffer + start, end - start);
   }
 else
   {
    response->write(LogBuffer + start, LogBufferSize - start);
    response->write(LogBuffer, end);
   }
 request->send(response);
}


//--------------------------------------------                                                //
// LOGBUFFER Stream all the circular log buffer directly to the client
//--------------------------------------------
void HandleTekstDownload(AsyncWebServerRequest *request)
{
 if (!LogBuffer) {request->send(200, "text/plain", "Log buffer uninitialized\n"); return; }
 AsyncResponseStream *response = request->beginResponseStream("text/plain");
 if (!LogWrapped) response->write(LogBuffer, LogWritePos);                                    // Buffer hasn't wrapped yet - just write from start to current position
 else                                                                                         // Buffer has wrapped - find the oldest complete line
   {
    ssize_t pos = LogWritePos;                                                                // Start from LogWritePos and scan forward to find first complete line
    while (pos < (ssize_t)LogBufferSize && LogBuffer[pos] != '\n')   pos++;                   // Scan forward to find the first '\n' (end of partial line)
    if (pos < (ssize_t)LogBufferSize) pos++;                                                  // Move past the '\n' to start of next complete line
    if (pos >= (ssize_t)LogBufferSize) pos = 0;                                               // If we've gone past the end, wrap to beginning
    size_t start = pos;
    if (start < LogWritePos) response->write(LogBuffer + start, LogWritePos - start);         // Data doesn't wrap                                                      // Now stream from start position (oldest complete line)
    else                                                                                      // Data wraps around - write in two parts
      {
       size_t tail = LogBufferSize - start;
       response->write(LogBuffer + start, tail);                                              // First part: start → end of buffer
       response->write(LogBuffer, LogWritePos);                                               // Second part: 0 → write position
      }
   }
 request->send(response);
}
/// ringbuffer
